Revit 2027 API
AdvancedTransparent Properties
The AdvancedTransparent type exposes the following members.
Properties
Name | Description
SurfaceAlbedo |  The property labeled "Color" from the "AdvancedTransparent" schema.
SurfaceAnisotropy |  The property labeled "Anisotropy" from the "AdvancedTransparent" schema.
SurfaceCutout |  The property labeled "Image" from the "AdvancedTransparent" schema.
SurfaceNdfType |  The property labeled "NDF" from the "AdvancedTransparent" schema.
SurfaceNormal |  The property labeled "Image" from the "AdvancedTransparent" schema.
SurfaceRotation |  The property labeled "Rotation" from the "AdvancedTransparent" schema.
SurfaceRoughness |  The property labeled "Roughness" from the "AdvancedTransparent" schema.
TransparentColor |  The property labeled "Color" from the "AdvancedTransparent" schema.
TransparentDistance |  The property labeled "Transparent Distance" from the "AdvancedTransparent" schema.
TransparentIor |  The property labeled "IOR" from the "AdvancedTransparent" schema.
Top
See Also
Reference
AdvancedTransparent Class
Autodesk.Revit.DB.Visual Namespace